# StairGetWFlight1M

## Description
Returns Width Of First Flight in meter or -1 in case of error.

```pascal
FUNCTION StairGetWFlight1M(stair : HANDLE): REAL;
```

```python
def vs.StairGetWFlight1M(stair):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE|   |

## Version
Availability: from Vectorworks 2021

## Category
* Objects - Stairs